Revit 2026 API

# RadialArrayArrayElementsWithoutAssociation Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ICollection<ElementId> ArrayElementsWithoutAssociation(
	Document aDoc,
	View dBView,
	ICollection<ElementId> ids,
	int count,
	Line axis,
	double angle,
	ArrayAnchorMember anchorMember
)
```
```vb
Public Shared Function ArrayElementsWithoutAssociation (
	aDoc As Document,
	dBView As View,
	ids As ICollection(Of ElementId),
	count As Integer,
	axis As Line,
	angle As Double,
	anchorMember As ArrayAnchorMember
) As ICollection(Of ElementId)
```
```cpp
public:
static ICollection<ElementId^>^ ArrayElementsWithoutAssociation(
	Document^ aDoc,
	View^ dBView,
	ICollection<ElementId^>^ ids,
	int count,
	Line^ axis,
	double angle,
	ArrayAnchorMember anchorMember
)
```
```fsharp
static member ArrayElementsWithoutAssociation :
        aDoc : Document *
        dBView : View *
        ids : ICollection<ElementId> *
        count : int *
        axis : Line *
        angle : float *
        anchorMember : ArrayAnchorMember -> ICollection<ElementId>
```

#### Parameters

aDoc Document

dBView View

ids ICollectionElementId

count Int32

axis Line

angle Double

anchorMember ArrayAnchorMember

#### Return Value

ICollectionElementId

#### Reference

RadialArray Class

Autodesk.Revit.DB Namespace